perf/loadTesting/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/ping'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Plain load
      duration: 60
      arrivalRate: 90
      rampTo: 5
    - name: Plain load 2
      duration: 60
      arrivalRate: 120
      rampTo: 5
    - name: Cool Down
      duration: 30
      arrivalRate: 1


scenarios:
  - name: LoadPing (/)
    flow:
      - get:
          url: '/'