perf/loadTesting/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/quote'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases: # revisar los numeros que tengan sentido
    - name: Warm Up
      duration: 30
      arrivalRate: 15
      rampTo: 100
    - name: Loaded
      duration: 30
      arrivalRate: 500
      rampTo: 2000
    - name: Cool Down
      duration: 30
      arrivalRate: 50
      rampTo: 5

scenarios:
  - name: Quote (/)
    flow:
      - get:
          url: '/'