perf/loadTesting/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/quote'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Plain load
      duration: 60
      arrivalRate: 100
    - name: Cool Down
      duration: 50
      arrivalRate: 1

scenarios:
  - name: LoadQuote (/)
    flow:
      - get:
          url: '/'