perf/loadTesting/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/quote'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases: # revisar los numeros que tengan sentido
    - name: Warm Up
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Loaded
      duration: 60
      arrivalRate: 90
      rampTo: 5
    - name: Loaded 2
      duration: 60
      arrivalRate: 120
      rampTo: 5
    - name: Loaded 3
      duration: 60
      arrivalRate: 180
      rampTo: 5
    - name: Loaded 4
      duration: 60
      arrivalRate: 250
      rampTo: 5
    - name: Cool Down
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Quote (/)
    flow:
      - get:
          url: '/'